Revit 2026 API
ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement Method
Overload List
Name | Description
ElementFilterIsAcceptableForParameterFilterElement(ElementFilter) |  Checks that an ElementFilter is acceptable for use in defining the filtering rules for a ParameterFilterElement (i.e., for view filtering).
ElementFilterIsAcceptableForParameterFilterElement(Document, ISet<ElementId>, ElementFilter)
Top
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace